feat: add new approch for verif
